/*---------------------------------------------------------------------------------------------
 *  Copyright (c) Microsoft Corporation. All rights reserved.
 *  Licensed under the MIT License. See License.txt in the project root for license information.
 *--------------------------------------------------------------------------------------------*/
// Do not edit this file. It is machine generated.
{
    "TipElementInspector": "Sie können den React DevTools Element Inspector ausführen, um die UI-Elemente Ihrer Anwendung zu überprüfen, indem Sie den Befehl „Run Element Inspector“ in der Befehlspalette starten. Beachten Sie, dass das Paket „react-devtools“ global installiert werden sollte",
    "TipLogCatMonitor": "Sie können einen LogCat-Monitor erstellen, der von der RNT-Erweiterung für das ausgewählte Online-Android-Gerät bereitgestellt wird, um die LogCat-Protokolle des Geräts anzuzeigen. Um es auszuprobieren, starten Sie einfach den Befehl „Run React Native LogCat Monitor“ in der Befehlspalette",
    "TipNetworkInspector": "Sie können den von der RNT-Erweiterung bereitgestellten Network Inspector verwenden, um den Netzwerkverkehr Ihrer App zu überprüfen. Um es auszuprobieren, starten Sie einfach den Befehl „Run Network Inspector“ in der Befehlspalette",
    "TipDirectDebuggingWithHermes": "Mit der RNT-Erweiterung können Sie RN-Anwendungen mit der Hermes-Engine debuggen. Um es auszuprobieren, fügen Sie einfach entsprechende Debug-Szenarien hinzu",
    "TipDebuggingRNWAndMacOSApps": "Sie können React Native Windows- und React Native MacOS-Apps über die RNT-Erweiterung debuggen. Um es auszuprobieren, fügen Sie einfach entsprechende Debug-Szenarien hinzu",
    "TipExpoHostType": "Sie können den Verbindungstyp (LAN, Tunnel oder Lokal) konfigurieren, der beim Expo-Debugging für die Kommunikation mit einem Gerät oder einem Emulator verwendet werden soll, indem Sie in Ihrer Debug-Konfiguration den Parameter „expoHostType“ angeben",
    "TipCustomEnvVariables": "Die RNT-Erweiterung unterstützt die Übergabe benutzerdefinierter Umgebungsvariablen an den RN Packager-Prozesskontext. Sie können dies tun, indem Sie benutzerdefinierte Variablen zur Datei „.env“ im Stammordner Ihres Projekts hinzufügen",
    "TipNetworkInspectorLogsColorTheme": "Die Erweiterung bietet „Dunkle“ und „Helle“ Farbthemen für Network Inspector-Protokolle. Sie können das Thema in der Erweiterungskonfiguration auf der Registerkarte „Einstellungen“ ändern"
}
