/*---------------------------------------------------------------------------------------------
 *  Copyright (c) Microsoft Corporation. All rights reserved.
 *  Licensed under the MIT License. See License.txt in the project root for license information.
 *--------------------------------------------------------------------------------------------*/
// Do not edit this file. It is machine generated.
{
    "TipElementInspector": "Você pode executar o React DevTools Element inspector para inspecionar os elementos da UI do seu aplicativo iniciando o comando 'Run Element Inspector' na paleta de comandos. Observe que o pacote 'react-devtools' deve ser instalado globalmente",
    "TipLogCatMonitor": "Você pode criar um LogCat Monitor fornecido pela extensão RNT para o dispositivo Android on-line escolhido para ver os logs do LogCat do dispositivo. Para experimentá-lo, basta iniciar o comando 'Run React Native LogCat Monitor' na paleta de comandos",
    "TipNetworkInspector": "Você pode usar o Network Inspector fornecido pela extensão RNT para inspecionar o tráfego de rede do seu aplicativo. Para testá-lo, basta iniciar o comando 'Run Network Inspector' na paleta de comandos",
    "TipDirectDebuggingWithHermes": "A extensão RNT permite depurar aplicativos RN com mecanismo Hermes. Para experimentar, basta adicionar cenários de depuração apropriados",
    "TipDebuggingRNWAndMacOSApps": "Você pode depurar aplicativos React Native Windows e React Native Macos por meio da extensão RNT. Para experimentar, basta adicionar cenários de depuração apropriados",
    "TipExpoHostType": "Você pode configurar o tipo de conexão (LAN, Túnel ou Local) a ser usado na depuração do Expo para se comunicar com um dispositivo ou emulador especificando o parâmetro 'expoHostType' em sua configuração de depuração",
    "TipCustomEnvVariables": "A extensão RNT suporta a passagem de variáveis ​​de ambiente personalizadas para o contexto do processo do RN Packager. Você pode fazer isso adicionando variáveis ​​personalizadas ao arquivo '.env' na pasta raiz do seu projeto",
    "TipNetworkInspectorLogsColorTheme": "A extensão fornece temas de cores 'escuro' e 'claro' para logs do Network Inspector. Você pode alterar o tema na configuração da extensão na guia Configurações"
}
