/*---------------------------------------------------------------------------------------------
 *  Copyright (c) Microsoft Corporation. All rights reserved.
 *  Licensed under the MIT License. See License.txt in the project root for license information.
 *--------------------------------------------------------------------------------------------*/
// Do not edit this file. It is machine generated.
{
    "TipElementInspector": "Puede ejecutar el inspector de elementos de React DevTools para inspeccionar los elementos de la interfaz de usuario de su aplicación iniciando el comando 'Ejecutar inspector de elementos' en la paleta de comandos. Tenga en cuenta que el paquete 'react-devtools' debe instalarse globalmente",
    "TipLogCatMonitor": "Puede crear un monitor LogCat proporcionado por la extensión RNT para el dispositivo Android en línea elegido para ver los registros de LogCat del dispositivo. Para probarlo, simplemente inicie el comando 'Ejecutar React Native LogCat Monitor' en la paleta de comandos",
    "TipNetworkInspector": "Puede usar Network Inspector proporcionado por la extensión RNT para inspeccionar el tráfico de red de su aplicación. Para probarlo, simplemente inicie el comando 'Ejecutar Network Inspector' en la paleta de comandos.",
    "TipDirectDebuggingWithHermes": "La extensión RNT le permite depurar aplicaciones RN con el motor Hermes. Para probarlo, simplemente agregue escenarios de depuración apropiados",
    "TipDebuggingRNWAndMacOSApps": "Puede depurar las aplicaciones React Native Windows y React Native Macos a través de la extensión RNT. Para probarlo, simplemente agregue escenarios de depuración apropiados.",
    "TipExpoHostType": "Puede configurar el tipo de conexión (LAN, Túnel o Local) que se utilizará en la depuración de Expo para comunicarse con un dispositivo o un emulador especificando el parámetro 'expoHostType' en su configuración de depuración.",
    "TipCustomEnvVariables": "La extensión RNT admite pasar variables de entorno personalizadas al contexto del proceso de RN Packager. Puede hacerlo agregando variables personalizadas al archivo '.env' en la carpeta raíz de su proyecto.",
    "TipNetworkInspectorLogsColorTheme": "La extensión proporciona temas de color 'Oscuro' y 'Claro' para los registros de Network Inspector. Puede cambiar el tema en la configuración de la extensión en la pestaña Configuración."
}
