/*---------------------------------------------------------------------------------------------
 *  Copyright (c) Microsoft Corporation. All rights reserved.
 *  Licensed under the MIT License. See License.txt in the project root for license information.
 *--------------------------------------------------------------------------------------------*/
// Do not edit this file. It is machine generated.
{
	"CommandFailed": "Wystąpił błąd podczas wykonywania polecenia „{0}”",
	"CommandFailedWithErrorCode": "Polecenie „{0}” nie powiodło się. Kod błędu: {1}",
	"ExpectedIntegerValue": "Oczekiwano liczby całkowitej. Nie można odczytać {0}",
	"PackagerStartFailed": "Błąd podczas wykonywania narzędzia do tworzenia pakietów platformy React Native.",
	"IOSDeployNotFound": "Nie można odnaleźć narzędzia ios-deploy. Upewnij się, że zainstalowano je globalnie („npm install -g ios-deploy”)",
	"DeviceNotPluggedIn": "Nie można zainstalować obrazu dysku dewelopera.",
	"DeveloperDiskImgNotMountable": "Nie można zainstalować obrazu dysku dewelopera.",
	"UnableToLaunchApplication": "Nie można uruchomić aplikacji.",
	"ApplicationLaunchTimedOut": "Przekroczono limit czasu podczas uruchamiania aplikacji. Czy urządzenie jest zablokowane?",
	"IOSSimulatorNotLaunchable": "Nie można uruchomić symulatora systemu iOS. Spróbuj określić inny element docelowy.",
	"OpnPackagerLocationNotFound": "Nie znaleziono lokalizacji pakietu opn",
	"OpnPackagerNotFound": "Nie znaleziono pakietu „opn”. {0}",
	"PackageNotFound": "Próba znalezienia pakietu {0} nie powiodła się z powodu błędu: {1}",
	"PlatformNotSupported": "Platforma „{0}” nie jest obsługiwana na platformie hosta: {1}",
	"ProjectVersionNotParsable": "Nie można przeanalizować składnika wersji pakietu w {0}: wersja = {1}",
	"ProjectVersionUnsupported": "Wersja projektu = {0}",
	"ProjectVersionNotReadable": "Nie można odczytać wersji = {0}",
	"TelemetryInitializationFailed": "{0}. Nie można zainicjować telemetrii",
	"ExtensionActivationFailed": "Nie można aktywować rozszerzenia narzędzi React Native Tools",
	"DebuggerStubLauncherFailed": "Nie można skonfigurować elementu uruchamiającego klasy zastępczej dla debugera",
	"IntellisenseSetupFailed": "Nie można zainstalować funkcji IntelliSense",
	"NodeDebuggerConfigurationFailed": "Nie można skonfigurować lokalizacji debugera węzła dla debugera",
	"FailedToStopPackagerOnExit": "Nie można zatrzymać narzędzia do tworzenia pakietów podczas zamykania narzędzi React Native Tools",
	"FailedToRunOnAndroid": "Nie można uruchomić aplikacji w systemie Android",
	"FailedToRunOnIos": "Nie można uruchomić aplikacji w systemie iOS",
	"FailedToRunExponent": "Nie można uruchomić aplikacji w środowisku Expo",
	"FailedToStartPackager": "Nie można uruchomić narzędzia do tworzenia pakietów platformy React Native",
	"FailedToStopPackager": "Nie można zatrzymać narzędzia do tworzenia pakietów platformy React Native",
	"FailedToRestartPackager": "Nie można ponownie uruchomić narzędzia do tworzenia pakietów platformy React Native",
	"DebuggingFailed": "Nie można debugować aplikacji",
	"DebuggingFailedInNodeWrapper": "Nie można debugować aplikacji z powodu błędu wewnętrznego debugera węzła",
	"RNTempFolderDeletionFailed": "Nie można usunąć folderu tymczasowego {0}",
	"CouldNotFindLocationOfNodeDebugger": "Nie można odnaleźć lokalizacji rozszerzenia debugera węzła",
	"PackagerRunningInDifferentPort": "Nie można uruchomić narzędzia do tworzenia pakietów na porcie {0}, ponieważ proces narzędzia do tworzenia pakietów jest już uruchomiony na porcie {1}",
	"ErrorWhileProcessingMessageInIPMSServer": "Wystąpił błąd podczas obsługi komunikatu: {0}",
	"ErrorNoPipeFound": "Nie można skonfigurować komunikacji z rozszerzeniem platformy React Native programu VSCode. Czy to jest projekt platformy React Native i upewniono się, że pakiet npm react-native został zainstalowany w katalogu głównym?",
	"NotAllSuccessPatternsMatched": "Nieznany błąd: nie wszystkie wzorce powodzenia zostały dopasowane. \n Oznacza to, że polecenie „react-native run-{0}” nie powiodło się. \n Sprawdź pozycje Widok -> Przełącz wyjście -> React Native, \nWidok -> Przełącz wyjście -> React Native: uruchom okna wyjściowe {1}.",
	"CouldNotParsePackageVersion": "Nie można przeanalizować składnika wersji pakietu w {0}: wersja = {1}",
	"UnsupportedCommandStatus": "Nieobsługiwany stan polecenia",
	"ExpectedExponentTunnelPath": "Brak linku udostępnionego przez środowisko Expo. Czy projekt jest poprawnie skonfigurowany?",
	"WorkspaceNotFound": "Wystąpił błąd podczas pracy z obszarem roboczym: {0}",
	"RNVersionNotSupportedByExponent": "Wersja platformy React Native nie jest obsługiwana przez środowisko Expo. Obsługiwane wersje główne: {0}",
	"UserCancelledExpoLogin": "Logowanie anulowane przez użytkownika.",
	"CannotAttachToPackagerCheckPackagerRunningOnPort": "Nie można dołączyć do narzędzia do tworzenia pakietów. Czy narzędzie do tworzenia pakietów istnieje i działa na porcie {0}? Jeśli narzędzie do tworzenia pakietów jest skonfigurowane do uruchamiania na innym porcie, to ustawienie musi zostać dodane do pliku settings.json.",
	"AnotherDebuggerConnectedToPackager": "Inny debuger jest już połączony z narzędziem do tworzenia pakietów. Zamknij go przed podjęciem próby debugowania za pomocą programu VSCode.",
	"NotInReactNativeFolderError": "Wygląda na to, że próbujesz debugować z katalogu, który nie jest katalogiem głównym projektu platformy React Native. \n Jeśli tak, wykonaj instrukcje podane tutaj: https://github.com/microsoft/vscode-react-native/blob/master/doc/customization.md#project-structure.",
	"SourcesStoragePathIsNullOrEmpty": "Argument SourcesStoragePath ma wartość null lub jest pusty",
	"AndroidCouldNotInstallTheAppOnAnyAvailibleDevice": "Nie można zainstalować aplikacji na żadnym dostępnym urządzeniu. Upewnij się, że masz działające \n prawidłowo skonfigurowane urządzenie lub emulator. Zobacz https://facebook.github.io/react-native/docs/android-setup.html.",
	"AndroidShellCommandTimedOut": "Przekroczono limit czasu polecenia powłoki systemu Android. Spróbuj ponownie wykonać operację.",
	"AndroidProjectNotFound": "Nie znaleziono projektu dla systemu Android.",
	"AndroidMoreThanOneDeviceOrEmulator": "Więcej niż jedno urządzenie/emulator",
	"AndroidFailedToLaunchTheSpecifiedActivity": "Nie można uruchomić określonego działania. Spróbuj uruchomić aplikację ręcznie i uruchom debugowanie przy użyciu konfiguracji uruchamiania „Attach to packager” (Dołącz do narzędzia do tworzenia pakietów).",
	"IOSFoundMoreThanOneExecutablesCleanupBuildFolder": "W folderze {0} znaleziono więcej niż jeden plik wykonywalny. Oczyść folder kompilacji lub zainstaluj opcję uruchamiania „productName”.",
	"IOSCouldNotFoundExecutableInFolder": "Nie można odnaleźć pliku wykonywalnego w {0}",
	"WinRNMPPluginIsNotInstalled": "Wtyczka „rnpm-plugin-windows” nie jest zainstalowana.",
	"ReactDevtoolsIsNotInstalled": "Pakiet React Devtools nie jest zainstalowany. Uruchom polecenie „npm install -g react-devtools” w terminalu, aby go zainstalować.",
	"DebuggingWontWorkReloadJSAndReconnect": "{0}. Debugowanie nie będzie działać. Spróbuj ponownie załadować kod JS z wewnątrz aplikacji lub podłącz ponownie debuger programu VS Code",
	"ReconnectionToPackagerFailedCheckForErrorsOrRestartReactNative": "Ponowne nawiązanie połączenia z serwerem proxy (narzędziem do tworzenia pakietów) nie powiodło się. Sprawdź okno danych wyjściowych pod kątem błędów narzędzia do tworzenia pakietów, jeśli wystąpiły. Jeśli problem będzie się powtarzał, uruchom ponownie debuger platformy React Native.",
	"FailedToProcessMessageFromReactNativeApp": "Nie można przetworzyć komunikatu z aplikacji platformy React Native. Komunikat:\n{0}",
	"FailedToPrepareJSRuntimeEnvironment": "Nie można przygotować środowiska uruchomieniowego języka JavaScript. Komunikat:\n{0}",
	"FailedToSendMessageToTheReactNativeApp": "Nie można wysłać komunikatu do aplikacji platformy React Native. Komunikat:\n{0}",
	"ReactNativeWorkerProcessThrownAnError": "Proces roboczy języka React Native zgłosił błąd",
	"CouldntImportScriptAt": "Nie można zaimportować skryptu w <{0}>",
	"RNMessageWithMethodExecuteApplicationScriptDoesntHaveURLProperty": "Klasa RNMessage z metodą „executeApplicationScript” nie ma właściwości „url”"
}