/*---------------------------------------------------------------------------------------------
 *  Copyright (c) Microsoft Corporation. All rights reserved.
 *  Licensed under the MIT License. See License.txt in the project root for license information.
 *--------------------------------------------------------------------------------------------*/
// Do not edit this file. It is machine generated.
{
	"CommandFailed": "Error al ejecutar el comando \"{0}\"",
	"CommandFailedWithErrorCode": "Error del comando \"{0}\" con el código {1}",
	"ExpectedIntegerValue": "Se esperaba un entero. No se pudo leer {0}",
	"PackagerStartFailed": "Error al ejecutar el empaquetador de React Native.",
	"IOSDeployNotFound": "No se encuentra ios-deploy. Asegúrese de instalarlo de forma global (\"npm install -g ios-deploy\")",
	"DeviceNotPluggedIn": "No se puede montar la imagen de disco del desarrollador.",
	"DeveloperDiskImgNotMountable": "No se puede montar la imagen de disco del desarrollador.",
	"UnableToLaunchApplication": "No se puede iniciar la aplicación.",
	"ApplicationLaunchTimedOut": "Se agotó el tiempo de espera de inicio de la aplicación. ¿Está bloqueado el dispositivo?",
	"IOSSimulatorNotLaunchable": "No se puede iniciar el simulador de iOS. Pruebe a especificar otro destino.",
	"OpnPackagerLocationNotFound": "No se encontró la ubicación del paquete opn.",
	"OpnPackagerNotFound": "No se encontró el paquete \"opn\". {0}",
	"PackageNotFound": "Error al intentar encontrar el paquete {0}: {1}",
	"PlatformNotSupported": "No se admite la plataforma \"{0}\" en la plataforma host: {1}",
	"ProjectVersionNotParsable": "No se pudo analizar el componente de versión del paquete en {0}: versión = {1}",
	"ProjectVersionUnsupported": "Versión del proyecto: {0}",
	"ProjectVersionNotReadable": "No se puede leer la versión {0}",
	"TelemetryInitializationFailed": "{0}. No se pudo inicializar la telemetría",
	"ExtensionActivationFailed": "No se pudo activar la extensión Herramientas de React Native.",
	"DebuggerStubLauncherFailed": "No se pudo configurar el iniciador de código auxiliar para el depurador.",
	"IntellisenseSetupFailed": "No se pudo configurar IntelliSense.",
	"NodeDebuggerConfigurationFailed": "No se pudo configurar la ubicación del depurador de Node para el depurador.",
	"FailedToStopPackagerOnExit": "No se pudo detener el empaquetador al cerrar las Herramientas de React Native.",
	"FailedToRunOnAndroid": "No se pudo ejecutar la aplicación en Android.",
	"FailedToRunOnIos": "No se pudo ejecutar la aplicación en iOS.",
	"FailedToRunExponent": "No se pudo ejecutar la aplicación en Expo.",
	"FailedToStartPackager": "No se pudo iniciar el empaquetador de React Native.",
	"FailedToStopPackager": "No se pudo detener el empaquetador de React Native.",
	"FailedToRestartPackager": "No se pudo reiniciar al empaquetador de React Native.",
	"DebuggingFailed": "No se puede depurar la aplicación",
	"DebuggingFailedInNodeWrapper": "No se puede depurar la aplicación debido a un error en el depurador de Node interno.",
	"RNTempFolderDeletionFailed": "No se pudo eliminar la carpeta temporal {0}",
	"CouldNotFindLocationOfNodeDebugger": "No se encontró la ubicación de la extensión node-debugger",
	"PackagerRunningInDifferentPort": "No se puede iniciar un empaquetador en el puerto {0} porque ya se está ejecutando un proceso de empaquetador en el puerto {1}.",
	"ErrorWhileProcessingMessageInIPMSServer": "Error al administrar el mensaje: {0}",
	"ErrorNoPipeFound": "No se puede establecer comunicación con la extensión react-native de VSCode. ¿Es este un proyecto de react-native? ¿Se ha asegurado de que el paquete npm de react-native está instalado en la raíz?",
	"NotAllSuccessPatternsMatched": "Error desconocido: no se encontraron coincidencias para todos los patrones de éxito. \n Esto implica un error del comando \"react-native run-{0}\". \n Consulte Ver -> Alternar salida -> React Native, \n Ver -> Alternar salida -> React Native: Run {1} output windows.",
	"CouldNotParsePackageVersion": "No se pudo analizar el componente de versión del paquete en {0}: versión = {1}",
	"UnsupportedCommandStatus": "Estado de comando no admitido",
	"ExpectedExponentTunnelPath": "Expo no ha proporcionado ningún vínculo. ¿Se ha configurado correctamente el proyecto?",
	"WorkspaceNotFound": "Error al usar el área de trabajo: {0}",
	"RNVersionNotSupportedByExponent": "Expo no admite la versión de React Native. Versiones principales admitidas: {0}",
	"UserCancelledExpoLogin": "El usuario ha cancelado el inicio de sesión.",
	"CannotAttachToPackagerCheckPackagerRunningOnPort": "No se puede asociar al empaquetador. ¿Seguro que hay un empaquetador y que se está ejecutando en el puerto {0}? Si el empaquetador está configurado para ejecutarse en otro puerto, asegúrese de agregarlo a settings.json.",
	"AnotherDebuggerConnectedToPackager": "Ya hay otro depurador conectado al empaquetador. Ciérrelo antes de intentar depurar con VSCode.",
	"NotInReactNativeFolderError": "Parece que está intentando depurar desde un directorio que no es raíz del proyecto de React Native. \n En ese caso, siga estas instrucciones: https://github.com/microsoft/vscode-react-native/blob/master/doc/customization.md#project-structure.",
	"SourcesStoragePathIsNullOrEmpty": "El argumento sourcesStoragePath era nulo o estaba vacío.",
	"AndroidCouldNotInstallTheAppOnAnyAvailibleDevice": "No se pudo instalar la aplicación en ningún dispositivo disponible. Asegúrese de tener un emulador o un dispositivo \n configurado correctamente en ejecución. Consulte https://facebook.github.io/react-native/docs/android-setup.html.",
	"AndroidShellCommandTimedOut": "Se agotó el tiempo de espera de un comando shell de Android. Reintente la operación.",
	"AndroidProjectNotFound": "No se ha encontrado ningún proyecto de Android.",
	"AndroidMoreThanOneDeviceOrEmulator": "Más de un dispositivo o emulador",
	"AndroidFailedToLaunchTheSpecifiedActivity": "No se pudo iniciar la actividad especificada. Pruebe a ejecutar la aplicación manualmente e inicie la depuración con la configuración de inicio \"Attach to packager\".",
	"IOSFoundMoreThanOneExecutablesCleanupBuildFolder": "Se encontró más de un ejecutable en {0}. Limpie la carpeta de compilación o configure la opción de inicio \"productName\".",
	"IOSCouldNotFoundExecutableInFolder": "No se encontró el ejecutable en {0}",
	"WinRNMPPluginIsNotInstalled": "No se ha instalado \"rnpm-plugin-windows\".",
	"ReactDevtoolsIsNotInstalled": "React DevTools no está instalado. Ejecute el comando \"npm install -g react-devtools\" en el terminal para instalarlo.",
	"DebuggingWontWorkReloadJSAndReconnect": "{0}. La depuración no funcionará: pruebe a recargar JS desde dentro de la aplicación o vuelva a conectar el depurador VS Code",
	"ReconnectionToPackagerFailedCheckForErrorsOrRestartReactNative": "Error al volver a conectarse al proxy (empaquetador). Consulte la ventana de salida para ver los errores del empaquetador, si los hay. Si el error persiste, reinicie el depurador de React Native.",
	"FailedToProcessMessageFromReactNativeApp": "No se pudo procesar el mensaje de la aplicación React Native. Mensaje:\n{0}",
	"FailedToPrepareJSRuntimeEnvironment": "No se pudo preparar el entorno de ejecución de JavaScript. Mensaje:\n{0}",
	"FailedToSendMessageToTheReactNativeApp": "No se pudo enviar el mensaje a la aplicación React Native. Mensaje:\n{0}",
	"ReactNativeWorkerProcessThrownAnError": "El proceso de trabajo de React Native generó un error.",
	"CouldntImportScriptAt": "No se pudo importar el script en <{0}>",
	"RNMessageWithMethodExecuteApplicationScriptDoesntHaveURLProperty": "El elemento RNMessage con el método \"executeApplicationScript\" no tiene la propiedad \"url\"."
}