/*---------------------------------------------------------------------------------------------
 *  Copyright (c) Microsoft Corporation. All rights reserved.
 *  Licensed under the MIT License. See License.txt in the project root for license information.
 *--------------------------------------------------------------------------------------------*/
// Do not edit this file. It is machine generated.
{
    "TipElementInspector": "Możesz uruchomić inspektora elementów React DevTools, aby sprawdzić elementy interfejsu użytkownika aplikacji, uruchamiając polecenie „Uruchom inspektora elementów” w palecie poleceń. Uwaga, pakiet „react-devtools” powinien być zainstalowany globalnie",
    "TipLogCatMonitor": "Możesz utworzyć monitor LogCat dostarczany przez rozszerzenie RNT dla wybranego urządzenia z systemem Android online, aby zobaczyć dzienniki LogCat urządzenia. Aby to wypróbować, po prostu uruchom polecenie „Uruchom React Native LogCat Monitor” w palecie poleceń",
    "TipNetworkInspector": "Możesz użyć Inspektora sieci dostarczonego przez rozszerzenie RNT, aby sprawdzić ruch sieciowy swojej aplikacji. Aby go wypróbować, po prostu uruchom polecenie „Uruchom inspektora sieci” w palecie poleceń",
    "TipDirectDebuggingWithHermes": "Rozszerzenie RNT umożliwia debugowanie aplikacji RN za pomocą silnika Hermes. Aby to wypróbować, wystarczy dodać odpowiednie scenariusze debugowania",
    "TipDebuggingRNWAndMacOSApps": "Możesz debugować aplikacje React Native Windows i React Native Macos za pośrednictwem rozszerzenia RNT. Aby to wypróbować, po prostu dodaj odpowiednie scenariusze debugowania",
    "TipExpoHostType": "Możesz skonfigurować typ połączenia (LAN, tunelowe lub lokalne), które będzie używane podczas debugowania Expo w celu komunikacji z urządzeniem lub emulatorem, określając parametr „expoHostType” w konfiguracji debugowania",
    "TipCustomEnvVariables": "Rozszerzenie RNT obsługuje przekazywanie niestandardowych zmiennych środowiskowych do kontekstu procesu RN Packager. Możesz to zrobić, dodając niestandardowe zmienne do pliku „.env” w folderze głównym swojego projektu",
    "TipNetworkInspectorLogsColorTheme": "Rozszerzenie udostępnia motywy kolorów „Ciemne” i „Jasne” dla dzienników Network Inspector. Motyw można zmienić w konfiguracji rozszerzenia na karcie Ustawienia"
}
