/*---------------------------------------------------------------------------------------------
 *  Copyright (c) Microsoft Corporation. All rights reserved.
 *  Licensed under the MIT License. See License.txt in the project root for license information.
 *--------------------------------------------------------------------------------------------*/
// Do not edit this file. It is machine generated.
{
    "TipElementInspector": "Uygulamanızın kullanıcı arayüzü öğelerini incelemek için Komut Paletinde 'Element Denetçisini Çalıştır' komutunu başlatarak React DevTools Element denetçisini çalıştırabilirsiniz, Not: 'react-devtools' paketi global olarak kurulmalıdır",
    "TipLogCatMonitor": "Cihazın LogCat günlüklerini görmek için seçilen çevrimiçi Android cihazı için RNT uzantısı tarafından sağlanan bir LogCat Monitörü oluşturabilirsiniz. Denemek için Komut Paletinde 'Run React Native LogCat Monitor' komutunu başlatmanız yeterlidir.",
    "TipNetworkInspector": "Uygulamanızın ağ trafiğini incelemek için RNT uzantısı tarafından sağlanan Ağ Denetleyicisini kullanabilirsiniz. Denemek için Komut Paletinde 'Ağ Denetleyicisini Çalıştır' komutunu başlatmanız yeterlidir.",
    "TipDirectDebuggingWithHermes": "RNT uzantısı, Hermes motoruyla RN uygulamalarında hata ayıklamanıza olanak tanır. Denemek için yalnızca uygun hata ayıklama senaryolarını eklemeniz yeterlidir.",
    "TipDebuggingRNWAndMacOSApps": "RNT uzantısı aracılığıyla React Native Windows ve React Native Macos uygulamalarında hata ayıklayabilirsiniz. Denemek için uygun hata ayıklama senaryolarını eklemeniz yeterlidir.",
    "TipExpoHostType": "Hata ayıklama yapılandırmanızda 'expoHostType' parametresini belirterek, bir cihaz veya emülatörle iletişim kurmak için Expo hata ayıklamasında kullanılacak bağlantı türünü (LAN, Tünel veya Yerel) yapılandırabilirsiniz.",
    "TipCustomEnvVariables": "RNT uzantısı, özel ortam değişkenlerinin RN Paketleyici işlem bağlamına aktarılmasını destekler. Bunu, projenizin kök klasöründeki '.env' dosyasına özel değişkenler ekleyerek yapabilirsiniz.",
    "TipNetworkInspectorLogsColorTheme": "Uzantı, Ağ Denetçisi günlükleri için 'Koyu' ve 'Açık' renk temaları sağlar. Temayı, Ayarlar sekmesindeki uzantı yapılandırmasında değiştirebilirsiniz."
}
