/*---------------------------------------------------------------------------------------------
 *  Copyright (c) Microsoft Corporation. All rights reserved.
 *  Licensed under the MIT License. See License.txt in the project root for license information.
 *--------------------------------------------------------------------------------------------*/
// Do not edit this file. It is machine generated.
{
    "TipElementInspector": "Vous pouvez exécuter l'inspecteur d'éléments React DevTools pour inspecter les éléments de l'interface utilisateur de votre application en lançant la commande « Exécuter l'inspecteur d'éléments » dans la palette de commandes. Remarque, le package « react-devtools » doit être installé globalement.",
    "TipLogCatMonitor": "Vous pouvez créer un moniteur LogCat fourni par l'extension RNT pour l'appareil Android en ligne choisi afin de voir les journaux LogCat de l'appareil. Pour l'essayer, lancez simplement la commande « Exécuter React Native LogCat Monitor » dans la palette de commandes.",
    "TipNetworkInspector": "Vous pouvez utiliser Network Inspector fourni par l'extension RNT pour inspecter le trafic réseau de votre application. Pour l'essayer, lancez simplement la commande « Exécuter Network Inspector » dans la palette de commandes.",
    "TipDirectDebuggingWithHermes": "L'extension RNT vous permet de déboguer les applications RN avec le moteur Hermes. Pour l'essayer, ajoutez simplement les scénarios de débogage appropriés.",
    "TipDebuggingRNWAndMacOSApps": "Vous pouvez déboguer les applications React Native Windows et React Native Macos via l'extension RNT. Pour l'essayer, ajoutez simplement les scénarios de débogage appropriés.",
    "TipExpoHostType": "Vous pouvez configurer le type de connexion (LAN, Tunnel ou Local) à utiliser lors du débogage Expo pour communiquer avec un périphérique ou un émulateur en spécifiant le paramètre 'expoHostType' dans votre configuration de débogage.",
    "TipCustomEnvVariables": "L'extension RNT prend en charge la transmission de variables d'environnement personnalisées au contexte de processus RN Packager. Vous pouvez le faire en ajoutant des variables personnalisées au fichier « .env » dans le dossier racine de votre projet.",
    "TipNetworkInspectorLogsColorTheme": "L'extension fournit des thèmes de couleurs « Sombre » et « Clair » pour les journaux de l'inspecteur de réseau. Vous pouvez modifier le thème dans la configuration de l'extension dans l'onglet Paramètres."
}
