/*---------------------------------------------------------------------------------------------
 *  Copyright (c) Microsoft Corporation. All rights reserved.
 *  Licensed under the MIT License. See License.txt in the project root for license information.
 *--------------------------------------------------------------------------------------------*/
// Do not edit this file. It is machine generated.
{
    "TipElementInspector": "Вы можете запустить инспектор элементов React DevTools для проверки элементов пользовательского интерфейса вашего приложения, запустив команду «Запустить инспектор элементов» в палитре команд. Обратите внимание: пакет «react-devtools» должен быть установлен глобально.",
    "TipLogCatMonitor": "Вы можете создать монитор LogCat, предоставляемый расширением RNT, для выбранного онлайн-устройства Android, чтобы просматривать журналы LogCat устройства. Чтобы опробовать его, просто запустите команду «Запустить React Native LogCat Monitor» в палитре команд.",
    "TipNetworkInspector": "Вы можете использовать Network Inspector, предоставляемый расширением RNT, для проверки сетевого трафика вашего приложения. Чтобы попробовать его, просто запустите команду «Запустить Network Inspector» на палитре команд.",
    "TipDirectDebuggingWithHermes": "Расширение RNT позволяет отлаживать приложения RN с помощью механизма Hermes. Чтобы опробовать его, просто добавьте соответствующие сценарии отладки.",
    "TipDebuggingRNWAndMacOSApps": "Вы можете отлаживать приложения React Native для Windows и React Native Macos с помощью расширения RNT. Чтобы опробовать его, просто добавьте соответствующие сценарии отладки.",
    "TipExpoHostType": "Вы можете настроить тип соединения (LAN, Tunnel или Local), который будет использоваться при отладке Expo для связи с устройством или эмулятором, указав параметр expoHostType в вашей конфигурации отладки.",
    "TipCustomEnvVariables": "Расширение RNT поддерживает передачу пользовательских переменных среды в контекст процесса RN Packager. Вы можете сделать это, добавив пользовательские переменные в файл «.env» в корневой папке вашего проекта.",
    "TipNetworkInspectorLogsColorTheme": "Расширение предоставляет «Темные» и «Светлые» цветовые темы для журналов Network Inspector. Вы можете изменить тему в конфигурации расширения на вкладке «Настройки»."
}
