/*---------------------------------------------------------------------------------------------
 *  Copyright (c) Microsoft Corporation. All rights reserved.
 *  Licensed under the MIT License. See License.txt in the project root for license information.
 *--------------------------------------------------------------------------------------------*/
// Do not edit this file. It is machine generated.
{
    "TipElementInspector": "Puoi eseguire l'ispettore elemento React DevTools per ispezionare gli elementi dell'interfaccia utente della tua applicazione avviando il comando \"Esegui ispettore elemento\" nella palette dei comandi. Nota, il pacchetto \"react-devtools\" deve essere installato a livello globale",
    "TipLogCatMonitor": "Puoi creare un LogCat Monitor fornito dall'estensione RNT per il dispositivo Android online scelto per visualizzare i log LogCat del dispositivo. Per provarlo, basta avviare il comando \"Esegui React Native LogCat Monitor\" nella palette dei comandi",
    "TipNetworkInspector": "Puoi utilizzare Network Inspector fornito dall'estensione RNT per ispezionare il traffico di rete della tua app. Per provarlo, avvia semplicemente il comando \"Esegui Network Inspector\" nella tavolozza dei comandi",
    "TipDirectDebuggingWithHermes": "L'estensione RNT ti consente di eseguire il debug delle applicazioni RN con il motore Hermes. Per provarlo, aggiungi semplicemente gli scenari di debug appropriati",
    "TipDebuggingRNWAndMacOSApps": "Puoi eseguire il debug delle app React Native Windows e React Native Macos tramite l'estensione RNT. Per provarlo, aggiungi semplicemente gli scenari di debug appropriati",
    "TipExpoHostType": "È possibile configurare il tipo di connessione (LAN, Tunnel o Locale) da utilizzare nel debug di Expo per comunicare con un dispositivo o un emulatore specificando il parametro 'expoHostType' nella configurazione di debug",
    "TipCustomEnvVariables": "L'estensione RNT supporta il passaggio di variabili di ambiente personalizzate al contesto del processo RN Packager. Puoi farlo aggiungendo variabili personalizzate al file \".env\" nella cartella principale del tuo progetto",
    "TipNetworkInspectorLogsColorTheme": "L'estensione fornisce temi di colore \"Scuro\" e \"Chiaro\" per i registri di Network Inspector. Puoi modificare il tema nella configurazione dell'estensione nella scheda Impostazioni"
}
