/*---------------------------------------------------------------------------------------------
 *  Copyright (c) Microsoft Corporation. All rights reserved.
 *  Licensed under the MIT License. See License.txt in the project root for license information.
 *--------------------------------------------------------------------------------------------*/
// Do not edit this file. It is machine generated.
{
	"CommandFailed": "Si è verificato un errore durante l'esecuzione del comando '{0}'",
	"CommandFailedWithErrorCode": "Il comando '{0}' non è riuscito. Codice errore: {1}",
	"ExpectedIntegerValue": "È previsto un intero. Non è stato possibile leggere {0}",
	"PackagerStartFailed": "Si è verificato un errore durante l'esecuzione dello strumento per la creazione di pacchetti React Native.",
	"IOSDeployNotFound": "Non è possibile trovare ios-deploy. Assicurarsi di installarlo globalmente ('npm install -g ios-deploy')",
	"DeviceNotPluggedIn": "Non è possibile montare l'immagine del disco per sviluppatori.",
	"DeveloperDiskImgNotMountable": "Non è possibile montare l'immagine del disco per sviluppatori.",
	"UnableToLaunchApplication": "Non è possibile avviare l'applicazione.",
	"ApplicationLaunchTimedOut": "Si è verificato un timeout durante l'avvio dell'applicazione. Il dispositivo è bloccato?",
	"IOSSimulatorNotLaunchable": "Non è possibile avviare il simulatore di iOS. Provare a specificare una destinazione diversa.",
	"OpnPackagerLocationNotFound": "Il percorso del pacchetto opn non è stato trovato",
	"OpnPackagerNotFound": "Il pacchetto 'opn' non è stato trovato. {0}",
	"PackageNotFound": "Il tentativo di individuazione del pacchetto {0} non è riuscito. Errore: {1}",
	"PlatformNotSupported": "La piattaforma '{0}' non è supportata nella piattaforma host: {1}",
	"ProjectVersionNotParsable": "Non è stato possibile analizzare il componente della versione del pacchetto alla posizione {0}. Versione = {1}",
	"ProjectVersionUnsupported": "Versione del progetto = {0}",
	"ProjectVersionNotReadable": "Non è possibile leggere la versione = {0}",
	"TelemetryInitializationFailed": "{0}. Non è stato possibile inizializzare la telemetria",
	"ExtensionActivationFailed": "Non è stato possibile attivare l'estensione React Native Tools",
	"DebuggerStubLauncherFailed": "Non è stato possibile configurare l'utilità di avvio stub per il debugger",
	"IntellisenseSetupFailed": "Non è stato possibile configurare IntelliSense",
	"NodeDebuggerConfigurationFailed": "Non è stato possibile configurare il percorso del debugger di Node per il debugger",
	"FailedToStopPackagerOnExit": "Non è stato possibile avviare lo strumento per la creazione di pacchetti React Native durante la chiusura di React Native Tools",
	"FailedToRunOnAndroid": "Non è stato possibile eseguire l'applicazione in Android",
	"FailedToRunOnIos": "Non è stato possibile eseguire l'applicazione in iOS",
	"FailedToRunExponent": "Non è stato possibile eseguire l'applicazione in Expo",
	"FailedToStartPackager": "Non è stato possibile avviare lo strumento per la creazione di pacchetti React Native",
	"FailedToStopPackager": "Non è stato possibile arrestare lo strumento per la creazione di pacchetti React Native",
	"FailedToRestartPackager": "Non è stato possibile riavviare lo strumento per la creazione di pacchetti React Native",
	"DebuggingFailed": "Non è possibile eseguire il debug dell'applicazione",
	"DebuggingFailedInNodeWrapper": "Non è possibile eseguire il debug dell'applicazione a causa di un errore nel debugger di Node interno",
	"RNTempFolderDeletionFailed": "Non è stato possibile eliminare la cartella temporanea {0}",
	"CouldNotFindLocationOfNodeDebugger": "Non è stato possibile trovare il percorso dell'estensione del debugger Node",
	"PackagerRunningInDifferentPort": "Non è possibile avviare uno strumento per la creazione di pacchetti sulla porta {0} perché un processo dello strumento per la creazione di pacchetti è già in esecuzione sulla porta {1}",
	"ErrorWhileProcessingMessageInIPMSServer": "Si è verificato un errore durante la gestione del messaggio: {0}",
	"ErrorNoPipeFound": "Non è possibile configurare la comunicazione con l'estensione react-native VS Code. È realmente un progetto react-native ed è stato verificato che il pacchetto npm react-native sia stato nella radice?",
	"NotAllSuccessPatternsMatched": "Errore sconosciuto: non è stato possibile abbinare tutti i criteri di riuscita. \n Il comando \"react-native run-{0}\" non è riuscito. \n Verificare le finestre di output in Visualizza -> Attiva/Disattiva output -> React Native o \n Visualizza -> Attiva/Disattiva output -> React Native: Esegui {1}.",
	"CouldNotParsePackageVersion": "Non è stato possibile analizzare il componente della versione del pacchetto alla posizione {0}. Versione = {1}",
	"UnsupportedCommandStatus": "Lo stato del comando non è supportato",
	"ExpectedExponentTunnelPath": "Expo non ha fornito alcun collegamento. Il progetto è correttamente configurato?",
	"WorkspaceNotFound": "Si è verificato un errore durante l'uso dell'area di lavoro: {0}",
	"RNVersionNotSupportedByExponent": "Expo non supporta la versione di React Native. Versioni principali supportate: {0}",
	"UserCancelledExpoLogin": "Accesso annullato dall'utente.",
	"CannotAttachToPackagerCheckPackagerRunningOnPort": "Non è possibile collegarsi allo strumento per la creazione di pacchetti. Si è sicuri che lo strumento per la creazione di pacchetti sia presente e che sia in esecuzione sulla porta {0}? Se lo strumento per la creazione di pacchetti è configurato per l'esecuzione su un'altra porta, assicurarsi di aggiungere tale impostazione a settings.json.",
	"AnotherDebuggerConnectedToPackager": "Allo strumento per la creazione di pacchetti è già connesso un altro debugger. Chiuderlo prima di provare a eseguire il debug con VS Code.",
	"NotInReactNativeFolderError": "Sembra che si stia eseguendo il debug da una directory che non è una radice di progetto React Native. \n In tal caso, seguire queste istruzioni: https://github.com/microsoft/vscode-react-native/blob/master/doc/customization.md#project-structure.",
	"SourcesStoragePathIsNullOrEmpty": "L'argomento sourcesStoragePath è Null o vuoto",
	"AndroidCouldNotInstallTheAppOnAnyAvailibleDevice": "Non è stato possibile installare l'app in nessun dispositivo disponibile. \n Assicurarsi che sia in esecuzione un dispositivo o un emulatore configurato correttamente. Vedere https://facebook.github.io/react-native/docs/android-setup.html.",
	"AndroidShellCommandTimedOut": "Si è verificato un timeout del comando della shell di Android. Ripetere l'operazione.",
	"AndroidProjectNotFound": "Il progetto Android non è stato trovato.",
	"AndroidMoreThanOneDeviceOrEmulator": "È presente più di un dispositivo/emulatore",
	"AndroidFailedToLaunchTheSpecifiedActivity": "Non è stato possibile avviare l'attività specificata. Provare a eseguire l'applicazione manualmente e avviare il debug con la configurazione di avvio 'Collega a strumento per la creazione di pacchetti'.",
	"IOSFoundMoreThanOneExecutablesCleanupBuildFolder": "Sono stati trovati più eseguibili in {0}. Pulire la cartella delle compilazioni oppure configurare l'opzione di avvio 'productName'.",
	"IOSCouldNotFoundExecutableInFolder": "Non è stato possibile trovare l'eseguibile in {0}",
	"WinRNMPPluginIsNotInstalled": "'rnpm-plugin-windows' non è installato.",
	"ReactDevtoolsIsNotInstalled": "React Devtools non è installato. Per installarlo, eseguire il comando `npm install -g react-devtools` nel terminale.",
	"DebuggingWontWorkReloadJSAndReconnect": "{0}. Il debug non funziona: provare a ricaricare JS dall'interno dell'app oppure riconnettere il debugger VS Code",
	"ReconnectionToPackagerFailedCheckForErrorsOrRestartReactNative": "La riconnessione al proxy (Strumento per la creazione di pacchetti) non è riuscita. Verificare la presenza di eventuali errori dello strumento per la creazione di pacchetti nella finestra di output. Se l'errore persiste, riavviare il debugger React Native.",
	"FailedToProcessMessageFromReactNativeApp": "Non è stato possibile elaborare il messaggio dall'app React Native. Messaggio:\n{0}",
	"FailedToPrepareJSRuntimeEnvironment": "Non è stato possibile preparare l'ambiente di runtime JavaScript. Messaggio:\n{0}",
	"FailedToSendMessageToTheReactNativeApp": "Non è stato possibile inviare il messaggio all'app React Native. Messaggio:\n{0}",
	"ReactNativeWorkerProcessThrownAnError": "Il processo di lavoro di React Native ha generato un errore",
	"CouldntImportScriptAt": "Non è stato possibile importare lo script alla posizione <{0}>",
	"RNMessageWithMethodExecuteApplicationScriptDoesntHaveURLProperty": "RNMessage con metodo 'executeApplicationScript' non contiene la proprietà 'url'"
}